Австралия/src/BusinessProcesses/PurchaseApproval/PurchaseApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>PurchaseApproval</name>
  <basedOn>Document.PurchaseOrder</basedOn>
  <task>Task.PerformerTask</task>
  <attributes>
    <name>Subject</name>
    <comment>System object for which the business process was created.</comment>
    <type>
      <types>DefinedType.TaskSubject</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Importance</name>
    <comment>Importance of tasks at action point Complete for assignee.</comment>
    <type>
      <types>EnumRef.TaskImportanceOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovalResult</name>
    <type>
      <types>EnumRef.ApprovalResults</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CompletedOn</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovalUntil</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovalDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovalDetails</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Approver</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>MainAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

Австралия/src/Enums/ApprovalResults/ApprovalResults.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ApprovalResults</name>
  <enumValues>
    <name>Approved</name>
  </enumValues>
  <enumValues>
    <name>NotApproved</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/BusinessProcesses/PurchaseApproval/Forms/ActionViewResult/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	InitialExecutionFlag = Object.Executed;
	ReadOnly = Object.Executed;
	
	If Not Object.Executed Then
		Object.CompletionDate = CurrentSessionDate();	
	EndIf;
	
	If TypeOf(Object.BusinessProcess) = Type("BusinessProcessRef.PurchaseApproval") Then
		BPAttributes = Common.ObjectAttributesValues(
			Object.BusinessProcess,
			"ApprovalResult, ApprovalDetails, Importance, StartDate");
		FillPropertyValues(ThisObject, BPAttributes);
		
		If BPAttributes.ApprovalResult = Enums.ApprovalResults.Approved Then
			Approved = NStr("en = 'Approved'; ru = 'Утвержден';pl = 'Zatwierdzony';es_ES = 'Aprobado';es_CO = 'Aprobado';tr = 'Onaylandı';it = 'Approvato';de = 'Genehmigt'");
		Else
			Approved = NStr("en = 'Not approved'; ru = 'Не утвержден';pl = 'Nie jest zatwierdzony';es_ES = 'No aprobado';es_CO = 'No aprobado';tr = 'Onaylanmadı';it = 'Non approvato';de = 'Nicht genehmigt'");
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure Reviewed(Command)

	ClearMessages();
	
	If Write() Then
		
		ReviewedServer();
		NotifyChanged(Object.Ref);
		
		ShowUserNotification(
			NStr("en = 'Change'; ru = 'Изменить';pl = 'Zmień';es_ES = 'Cambiar';es_CO = 'Cambiar';tr = 'Değiştir';it = 'Modificare';de = 'Ändern'"),
			GetURL(Object.Ref),
			String(Object.Ref),
			PictureLib.Information32);
		
		Close();
		
	EndIf;
	
EndProcedure

&AtClient
Procedure Save(Command)

	If Write() Then
		
		NotifyChanged(Object.Ref);
		
		ShowUserNotification(
			NStr("en = 'Change'; ru = 'Изменить';pl = 'Zmień';es_ES = 'Cambiar';es_CO = 'Cambiar';tr = 'Değiştir';it = 'Modificare';de = 'Ändern'"),
			GetURL(Object.Ref),
			String(Object.Ref),
			PictureLib.Information32);
		
	EndIf;

EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure ReviewedServer()

	BusinessProcessesAndTasksServerCall.ExecuteTask(Object.Ref);
	
EndProcedure


#EndRegion
